cylinder_inertial/cylinder_Re250/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    wing
    {
        type            zeroGradient;
    }

    top
    {
    	type 		outletInlet;
	outletValue	$internalField;
	value		uniform 0;
    }
    
    bottom
    {
	type            outletInlet;
        outletValue     $internalField;
        value           uniform 0;
    }

    front
    {
    	type 		empty;
    }

    back
    {
    	type 		empty;
    }

   // #include "include/frontBackTopBottomPatches"
}

// ************************************************************************* //
